---
kind: property
id: P:Autodesk.Revit.DB.GBXMLExportOptions.Encoding
source: html/2b7705c3-a448-6ff1-c27a-e1d06cbfba48.htm
---
# Autodesk.Revit.DB.GBXMLExportOptions.Encoding Property

The encoding options to go into the processing instruction for the exported gbXML file.

## Syntax (C#)
```csharp
public string Encoding { get; }
```